vlm/extension/Documents/ДвижениеПродукцииИМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДвижениеПродукцииИМатериалов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>ЛТ5.33 Имя для типового механизма подбора серий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОбеспечения</Name>
							<Comment>ЛТ5.33 Имя для типового механизма подбора серий</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ДвижениеПродукцииИМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] +        
	//Механизм подбора серий заменен по аналогии из документа ЗаказМатериаловВПроизводство
	
	Элементы.ТоварыУказатьСерии.Видимость = Ложь;
	
	ОписаниеКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3));
	ОписаниеБулево = Новый ОписаниеТипов("Булево", );	                                           
	ОписаниеСклады = Новый ОписаниеТипов(Новый ОписаниеТипов("СправочникСсылка.Склады"));
	
	МассивРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("ДоступныеОстаткиПараметрыВстраивания", Новый ОписаниеТипов());
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Доступно", ОписаниеКоличества, "Объект.Товары");
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ОтгружатьЕслиДоступно", ОписаниеБулево, "Объект.Товары");
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("Обособленно", ОписаниеБулево, "Объект.Товары");
	МассивРеквизитов.Добавить(НовыйРеквизит);           
	
	НовыйРеквизит = Новый РеквизитФормы("Склад", ОписаниеСклады, "Объект.Товары");
	МассивРеквизитов.Добавить(НовыйРеквизит);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("ТоварыДоступно", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.Доступно";
	НовыйЭлемент.Видимость = Ложь;
	
	
	НовыйЭлемент = Этаформа.Элементы.Вставить("ТоварыВариантОбеспечения", Тип("ПолеФормы"), Элементы.Товары);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Товары.ВариантОбеспечения";
	НовыйЭлемент.Видимость = Ложь;
		
	ПараметрыВстраивания = Документы.ДвижениеПродукцииИМатериалов.ДоступныеОстаткиПараметрыВстраивания();
	ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриСозданииНаСервере(ЭтотОбъект, ПараметрыВстраивания);
	
	ОбновитьКолонкуДоступноСервер();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] -
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыСерияНачалоВыбора")
Процедура бит_ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Удаление
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
	#конецУдаления
	
	
	#Вставка // {{ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] +        
	
	Объект.Склад = Объект.Отправитель;
	
	ОбновитьКолонкуДоступноСервер();
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерийТовары(Элемент.ТекстРедактирования); 
	
	#КонецВставки // }}ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] -
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийТовары(Текст = "", ТекущиеДанные = Неопределено)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] +        
	
	ПараметрыФормы = ПараметрыФормыЗапросаКоличестваИСерий(ОбеспечениеВДокументахКлиентСервер.РежимПодборСерий());
	Если ПараметрыФормы <> Неопределено Тогда
		
		ПараметрыФормы.Вставить("бит_ДвижениеПродукцииИМатериалов", Истина);
		
		ОткрытьФорму(
			"Обработка.ЗапросКоличестваИСерий.Форма",
			ПараметрыФормы,
			ЭтотОбъект,
			,
			,
			,
			Новый ОписаниеОповещения("ОбработатьВыборСкладаИСерии", ЭтотОбъект, ПараметрыФормы));
			
	КонецЕсли;
 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] -
			
КонецПроцедуры   

&НаКлиенте
Функция ПараметрыФормыЗапросаКоличестваИСерий(Режим)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] +        
	
	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения();
	
	Если Не ОбеспечениеКлиент.ПроверитьЗаполнение(
				Объект,
				Объект.Товары,
				Элементы.Товары.ТекущаяСтрока,
				ПараметрыПроверки,
				Объект.Отправитель,
				Режим) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыВыбораОбеспечения(Режим);
	
	ПараметрыФормы.Регистратор = Объект.Ссылка;
	
	ПараметрыФормы.ПараметрыУказанияСерий = ПараметрыУказанияСерий;
	
	Возврат ПараметрыФормы; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] -
	
КонецФункции 

&НаСервере
Функция ПараметрыВыбораОбеспечения(Режим)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] +        
	
	ПараметрыФормы = ОбеспечениеВДокументахСервер.ПараметрыВыбораОбеспечения(
		ЭтотОбъект,
		Элементы.Товары.ТекущаяСтрока,
		Режим);
	
	Возврат ПараметрыФормы; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.33] [ASHolyavko@1cbit.ru] [04.03.2026] -
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборСкладаИСерии(ВыбранноеЗначение, ПараметрыФормы) Экспорт
	
	Если Не ОбеспечениеВДокументахКлиент.ЕстьПодобранныеТовары(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбеспечениеВДокументахКлиент.ПоказатьВопросСнятьФлагОтгружатьОднойДатойПослеВыбораОбеспечения(
		ЭтотОбъект,
		ВыбранноеЗначение,
		ПараметрыФормы,
		"ОбработатьВыборСкладаИСерииПослеВопроса");
		
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, СтруктураДействий);
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		//ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСкладаИСерииПослеВопроса(Ответ, Параметры) Экспорт
	
	ПараметрыЗаполнения = ОбеспечениеВДокументахКлиент.ПараметрыОбработкиДатОтгрузкиПослеЗаполненияОбеспечения(Ответ);
	
	Оповещение = ОбработатьВыборСкладаИСерииНаСервере(
		Параметры.ВыбранноеЗначение,
		Параметры.ПараметрыФормы,
		ПараметрыЗаполнения);
		
	ТекстОповещения = ОбеспечениеВДокументахКлиент.ТекстОповещенияОбработкиВыборСкладаИСерии(Параметры.ПараметрыФормы.Режим);
	ПоказатьОповещениеПользователя(ТекстОповещения, , Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВыборСкладаИСерииНаСервере(ВыбранноеЗначение, ПараметрыФормы, ПараметрыЗаполнения)
	
	Модифицированность = Истина;
	Изменения = ОбеспечениеВДокументахСервер.ПриВыбореСклада(
		ВыбранноеЗначение,
		ЭтотОбъект,
		Элементы.Товары.ТекущаяСтрока,
		ПараметрыФормы.ЗаполняемыеПоля);
		
	ЗаполнитьПараметрыУказанияСерий();
	ТекстОбработаноСтрок = ОбеспечениеВДокументахСервер.ТекстОбработаноСтрок(Изменения.Количество());
	Возврат ТекстОбработаноСтрок;
	
КонецФункции

&НаСервере
Процедура ОбновитьКолонкуДоступноСервер()
	
	ОбеспечениеВДокументахСервер.ОбновитьКолонкуДоступно(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыУказанияСерий()
		
	Документы.ДвижениеПродукцииИМатериалов.ЗаполнитьПараметрыУказанияСерий(Объект);
	
	Объект.ВидыЗапасов.Очистить();
	
КонецПроцедуры
